tests/performance/alwaystrack-smoke.yml
config:
  target: "http://localhost:3333"
  phases:
    - duration: 6
      arrivalRate: 1
      name: local smoke
  http:
    cookieJar: true
  defaults:
    headers:
      content-type: application/json
scenarios:
  - name: authenticated commercial read path
    flow:
      - get:
          url: "/health"
      - post:
          url: "/v1/auth/login"
          json:
            email: "admin@example.com"
            password: "{{ $processEnvironment.SEED_ADMIN_PASSWORD }}"
      - get:
          url: "/v1/sales/dashboard"
      - get:
          url: "/v1/sales/ranking"
      - get:
          url: "/v1/sales/statements"
      - get:
          url: "/v1/wiki/pages"
      - get:
          url: "/v1/faq/threads"
      - get:
          url: "/v1/service-flows"
      - get:
          url: "/v1/script-library"
          capture:
            - json: "$.data.scripts[0].id"
              as: "scriptId"
      - post:
          url: "/v1/script-library/scripts/{{ scriptId }}/copy"
          json:
            renderedText: "Smoke local de copia da Scriptoteca"
            placeholders: {}
      - get:
          url: "/v1/in-app-notifications"